{
  "data": [
    {
      "category": "Pulp and Paper",
      "content": ": Valmet Oyj has received its first automation order from Papertech Industries Co., Ltd. in Bangladesh. The company will supply a comprehensive automation package aimed at improving production quality and operational efficiency at Papertech’s manufacturing facility.\r\n\r\nThe order was booked in Valmet’s second-quarter 2025 figures, with delivery scheduled for the fourth quarter of this year. The order value remains undisclosed.\r\n\r\nThe project represents a key step for Papertech Industries as it upgrades to advanced automation technologies. The systems are expected to help minimize quality variation, optimize raw material usage, and improve operational convenience through a secure and intuitive automation platform.\r\n\r\nThe delivery includes Bangladesh’s first distributed control system (DCS) with Valmet’s modern DNAe User Interface. The technology is designed to streamline workflows and enable operators to manage wider process areas with greater efficiency.\r\n\r\n“We have taken the decision to partner with Valmet due to the latest technology and Valmet’s process knowhow, presence and approach. We believe that this partnership will provide us with the best technology and quality systems from Europe to help us achieve our quality goals in producing world-class paper,” says Amer Yusuf, Managing Director, Papertech Industries Ltd.\r\n\r\n“This marks a significant milestone for Papertech as we continue our journey to become a regional leader in high-performance and sustainable paper production. Valmet’s automation technology aligns with our long-term strategy for smart, resource-efficient manufacturing. We are proud to be the first in Bangladesh to deploy such cutting-edge systems,” says Saad Ahmed Suman, CEO & Director, Papertech Industries Co., Ltd.\r\n\r\n“We are glad to work with Papertech. They have shared their vision to be a top-quality paper producer, and we have aligned our solutions accordingly. Our delivery will help them to achieve their quality and cost goals and make them a more sustainable paper products producer in the market,” says Ramesh Chandra, Sales Manager, Automation Solutions business area, India, Asia-Pacific, Valmet.\r\n\r\nThe delivery scope includes the Valmet DNA Distributed Control System (DCS), Valmet IQ Quality Control System, machine and cross-directional controls, and Valmet Retention Measurement (Valmet RM5).",
      "country": "Finland",
      "created_at": "2025-08-28 05:24:14",
      "created_by": "Admin",
      "id": "68afe7feaee2dfa06d5547bd",
      "image_caption": "Valmet to supply automation package to Papertech Industries in Bangladesh. (Source: Valmet)",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_Expands_Presence_in_Bangladesh_with_Papertech_Automation_Deal_20250828052414/Valmet_to_supply_automation_package_to_Papertech_Industries_in_Bangladesh._(Source:_Valmet)_mobile.jpeg",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-28",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_Expands_Presence_in_Bangladesh_with_Papertech_Automation_Deal_20250828052414/Valmet_to_supply_automation_package_to_Papertech_Industries_in_Bangladesh._(Source:_Valmet)_thumbnail.jpeg",
      "title": "Valmet Expands Presence in Bangladesh with Papertech Automation Deal",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_Expands_Presence_in_Bangladesh_with_Papertech_Automation_Deal_20250828052414/Valmet_to_supply_automation_package_to_Papertech_Industries_in_Bangladesh._(Source:_Valmet).jpeg"
    },
    {    
      "category": "Biotechnology",
      "content": ": Union Minister of Science and Technology Dr. Jitendra Singh marked one year of India’s BioE3 (Biotechnology for Economy, Environment and Employment) Policy by launching the BioE3 Challenge for Youth and the country’s first National Biofoundry Network.\r\n\r\n“India’s bioeconomy has grown from just $10 billion in 2014 to $165.7 billion in 2024, and we are now working towards a target of $300 billion by 2030,” said Dr. Singh, highlighting rapid progress in biotechnology under the BioE3 framework.\r\n\r\nThe BioE3 Challenge for Youth invites students, researchers, startups, and innovators to design safe biological solutions for health, agriculture, environment, and industry. Top solutions will receive cash awards, mentoring, and funding for proof-of-concept projects through BIRAC, with access to facilities at BRIC+ institutions.\r\n\r\nThe National Biofoundry Network, involving six institutions, aims to scale proof-of-concept developments, strengthen indigenous biomanufacturing, and create employment opportunities.\r\n\r\nProf. Ajay Kumar Sood, Principal Scientific Adviser to the Government of India, noted that the BioE3 policy leverages biotechnology to advance public health, sustainability, and climate action while generating new career avenues for India’s youth.",
      "country": "India",
      "created_at": "2025-08-28 05:32:39",
      "created_by": "Admin",
      "id": "68afe9f7aee2dfa06d5547c0",
      "image_caption": "Source: Press Information Bureau (PIB) Delhi.",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_Bioeconomy_to_Hit_$300_Billion_by_2030,_Said_Dr._Jitendra_Singh_20250828053239/Source:_Press_Information_Bureau_(PIB)_Delhi._mobile.jpg",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-28",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_Bioeconomy_to_Hit_$300_Billion_by_2030,_Said_Dr._Jitendra_Singh_20250828053239/Source:_Press_Information_Bureau_(PIB)_Delhi._thumbnail.jpg",
      "title": "India’s Bioeconomy to Hit $300 Billion by 2030, Said Dr. Jitendra Singh",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_Bioeconomy_to_Hit_$300_Billion_by_2030,_Said_Dr._Jitendra_Singh_20250828053239/Source:_Press_Information_Bureau_(PIB)_Delhi..jpg"
    },
    {
      "category": "Specialty Chemicals",
      "content": ": IMCD N.V. has signed an agreement to acquire all shares of Tillmanns S.p.A., a well-established distributor of specialty chemicals in Italy. Tillmanns serves a broad customer base and partners with global suppliers across the coatings, construction, food & nutrition, and water treatment sectors.\r\n\r\nWith a team of 78 employees, Tillmanns is recognised for its technical knowledge, strong commercial execution, and long-standing customer relationships. The company operates a logistics centre in Milan and maintains an in-house R&D laboratory providing advanced testing, custom formulations, and technical support. Tillmanns reported revenues of approximately EUR 143 million in 2024.\r\n\r\nThe acquisition aligns strategically with IMCD’s growth plans in Italy, enhancing market scale and presence while opening opportunities across industrial and food sectors. Tillmanns’ premium positioning and exclusive supplier relationships support IMCD’s goal of delivering value-driven solutions, technical support, and digital capabilities at scale.\r\n\r\n“This is a great step forward in strengthening our footprint in Italy,” said Marcus Jordan, CEO of IMCD. “Tillmanns brings deep local expertise, a loyal customer base, and a strong platform for growth in industrial, water and food applications, making it a real powerhouse for our partners, teams and suppliers in Italy. We are also excited to welcome a skilled and experienced team that will add real value to our organisation and bring continuity and established business relationships for customers and suppliers.”\r\n\r\nThe transaction is subject to customary regulatory closing conditions and is expected to complete in the fourth quarter of 2025.\r\n",
      "country": "Netherlands",
      "created_at": "2025-08-28 05:26:57",
      "created_by": "Admin",
      "id": "68afe8a1aee2dfa06d5547be",
      "image_caption": "IMCD Strengthens Footprint in Italy with Tillmanns Acquisition",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition_20250828052656/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition_mobile.jpg",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-28",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition_20250828052656/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition_thumbnail.jpg",
      "title": "IMCD Strengthens Footprint in Italy with Tillmanns Acquisition",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition_20250828052656/IMCD_Strengthens_Footprint_in_Italy_with_Tillmanns_Acquisition.jpg"
    },
    {
      "category": "Electronics and Electroplating",
      "content": " :  Maruti Suzuki has commenced production of lithium-ion battery cells and electrodes in India, in collaboration with Toshiba and Denso, at its Hansalpur plant in Gujarat. The inauguration was attended by Prime Minister Narendra Modi, Chief Minister of Gujarat Bhupendra Patel, and Keiichi Ono, Ambassador of Japan to India. The cells produced at this facility will power Maruti Suzuki’s new Battery Electric Vehicle (BEV), the e-Vitara, which is slated for export to 100 countries. Internationally, the e-Vitara will be offered in two battery capacities: 49 kWh and 61 kWh.\r\n\r\nEstablished as a joint venture between Toshiba, Denso, and Suzuki, the Hansalpur facility represents India’s first lithium-ion battery manufacturing plant in Gujarat. With a total investment of ₹4,267 crore, the plant has an annual manufacturing capacity of 7,50,000 units, underscoring Maruti Suzuki’s commitment to accelerating the country’s EV ecosystem.\r\n\r\nSource: Maruti Suzuki starts Lithium-ion cell and electrode production in India | Story by Ryan Paul Massey.\r\n\r\n",
      "country": "India",
      "created_at": "2025-08-26 11:12:34",
      "created_by": "Admin",
      "id": "68ad96a2aee2dfa06d5547b9",
      "image_caption": "Pic source: Hindustan Times",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_First_BEV_Battery_Plant_Launched_by_Maruti_Suzuki_in_Gujarat_20250826111234/Pic_source:_Hindustan_Times.webp",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-26",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_First_BEV_Battery_Plant_Launched_by_Maruti_Suzuki_in_Gujarat_20250826111234/Pic_source:_Hindustan_Times.webp",
      "title": "India’s First BEV Battery Plant Launched by Maruti Suzuki in Gujarat",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/India’s_First_BEV_Battery_Plant_Launched_by_Maruti_Suzuki_in_Gujarat_20250826111234/Pic_source:_Hindustan_Times.webp"
    },
    {
      "category": "Pharma",
      "content": " :  ANI Pharmaceuticals, Inc. announced that its President and Chief Executive Officer, Nikhil Lalwani, along with members of the executive leadership team, will present at two upcoming investor conferences in September. The company will participate in the H.C. Wainwright 27th Annual Global Investment Conference on Monday, September 8, 2025, at 9:00 a.m. ET, followed by the Morgan Stanley 23rd Annual Global Healthcare Conference on Tuesday, September 9, 2025, at 1:50 p.m. ET.\r\n\r\nThe live and archived webcasts of both presentations will be available on ANI Pharmaceuticals’ official website in the Investors section under Events and Presentations. The replays will remain accessible for 90 days.ANI Pharmaceuticals, headquartered in Princeton, New Jersey, develops, manufactures, and commercializes therapeutics across rare diseases, generics, and branded products.\r\n",
      "country": "USA",
      "created_at": "2025-08-26 05:17:33",
      "created_by": "Admin",
      "id": "68ad436daee2dfa06d5547ad",
      "image_caption": "Source: ANI Pharmaceuticals.",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/ANI_Pharmaceuticals_to_Present_at_Two_Major_Investor_Conferences_20250826051733/Source:_ANI_Pharmaceuticals..webp",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-26",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/ANI_Pharmaceuticals_to_Present_at_Two_Major_Investor_Conferences_20250826051733/Source:_ANI_Pharmaceuticals..webp",
      "title": "ANI Pharmaceuticals to Present at Two Major Investor Conferences",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/ANI_Pharmaceuticals_to_Present_at_Two_Major_Investor_Conferences_20250826051733/Source:_ANI_Pharmaceuticals..webp"
    },
    {
      "category": "Specialty Chemicals",
      "content": " :  Covestro has announced the appointment of Ms. Annie Chen as Managing Director of Covestro Taiwan, effective September 1, 2025. She will succeed Dr. Carsten Wildebrand, who returns to Covestro’s headquarters in Germany after completing his tenure on August 31.\r\n\r\nDr. Wildebrand, who has led Covestro Taiwan since July 2022, reflected on his time in the role: “During these three years, I have experienced many exciting and productive challenges and achievements together with my colleagues at Covestro Taiwan. I sincerely thank all employees for their trust and dedication.”\r\n\r\nHe praised Ms. Chen as a “trusted and experienced leader” with extensive Asia-Pacific expertise, confident she will continue driving growth with clear direction.\r\n\r\nMs. Chen, who began her career at Covestro’s predecessors in 1996, has held senior roles in sales, procurement, customer service, and logistics. Alongside her new role, she will continue overseeing supply chain and logistics for Taiwan, Korea, New Zealand, and Australia.\r\n\r\n“I am excited to take on the role,” Chen said. “Covestro is at a transformation period, and I look forward to working with Taiwan’s excellent team to continue advancing the company’s sustainability strategy and strengthening our leadership position in the market.”\r\n",
      "country": "Taiwan",
      "created_at": "2025-08-25 05:37:00",
      "created_by": "Admin",
      "id": "68abf67caee2dfa06d554799",
      "image_caption": "Annie Chen. (Source: Covestro)",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Covestro_Names_Annie_Chen_as_Managing_Director_of_Taiwan_Operations_20250825053700/Annie_Chen._(Source:_Covestro).webp",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-25",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Covestro_Names_Annie_Chen_as_Managing_Director_of_Taiwan_Operations_20250825053700/Annie_Chen._(Source:_Covestro).webp",
      "title": "Covestro Names Annie Chen as Managing Director of Taiwan Operations",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Covestro_Names_Annie_Chen_as_Managing_Director_of_Taiwan_Operations_20250825053700/Annie_Chen._(Source:_Covestro).webp"
    },
    {
      "category": "Pulp and Paper",
      "content": " :  Valmet will deliver an IntelliTissue 1600 tissue machine to PT Suparma Tbk’s Surabaya mill, expanding production capacity by 26,500 tons annually. The installation, planned for start-up in 2026, will support high-quality tissue production for the Asia Pacific market.\r\n\r\nThe order, part of Valmet’s Q2 2025 orders received, continues a longstanding collaboration between the two companies. Their most recent joint project was an IntelliTissue machine (TM10) commissioned in 2022 at the same mill.\r\n\r\n“It is a pleasure to expand our cooperation with Valmet through our new Tissue Machine investment. We chose Valmet as the supplier for our milestone project due to their good understanding of our specific needs, and the excellent collaboration between our teams demonstrated during the previous project. Undoubtedly, we wish to grow our partnership further in the future,” said Joseph Sulaiman, Director, PT Suparma Tbk.\r\n\r\nThe delivery will include a complete tissue production line, comprising stock preparation equipment, IntelliJet V headbox, Crescent Former, IntelliPress, IntelliYankee dryer, Exhaust Cap hood, IntelliReel section, mechanical and electrical drives, Valmet DNA system with Machine Control System, Distributed Control System, Quality Control System, dust removal system, and auxiliary systems.\r\n\r\nPemo Klimczak, Vice President, SMM business unit, Valmet, added, “We have a long and successful history of co-operation with PT Suparma Tbk. We are proud to once again have gained their trust to supply the reliable and resource efficient IntelliTissue concept and work together enhancing their continued tissue expansion. I am convinced that this will be another efficient project and smooth start-up together.”\r\n\r\n",
      "country": "Indonesia",
      "created_at": "2025-08-25 08:41:27",
      "created_by": "Admin",
      "id": "68ac21b7aee2dfa06d5547a2",
      "image_caption": "Valmet to deliver IntelliTissue 1600 to PT Suparma Tbk in Surabaya (Source: Valmet).",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_and_PT_Suparma_Tbk_Strengthen_Tissue_Partnership_in_Indonesia_20250825084127/Valmet_to_deliver_IntelliTissue_1600_to_PT_Suparma_Tbk_in_Surabaya_(Source:_Valmet)..webp",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-25",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_and_PT_Suparma_Tbk_Strengthen_Tissue_Partnership_in_Indonesia_20250825084127/Valmet_to_deliver_IntelliTissue_1600_to_PT_Suparma_Tbk_in_Surabaya_(Source:_Valmet)..webp",
      "title": "Valmet and PT Suparma Tbk Strengthen Tissue Partnership in Indonesia",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Valmet_and_PT_Suparma_Tbk_Strengthen_Tissue_Partnership_in_Indonesia_20250825084127/Valmet_to_deliver_IntelliTissue_1600_to_PT_Suparma_Tbk_in_Surabaya_(Source:_Valmet)..webp"
    },
    {
      "category": "Agrochemicals and Fertilizers",
      "content": " :  Brazil Potash Corp. has announced a definitive 10-year offtake agreement with Keytrade Fertilizantes Brasil Ltda., the Brazilian arm of Keytrade AG. The binding take-or-pay contract commits Keytrade to purchase up to 900,000 tons of potash annually from the company’s Autazes Potash Project in Manaus.\r\n\r\nThe agreement finalizes a memorandum of understanding signed in January 2025 and represents the company’s second major commercial milestone, following the securing of contracts with Amaggi Exportacão E Importacão Ltda. With both commitments combined, Brazil Potash now has binding agreements covering approximately 1.45 million tons annually, nearly 60 percent of its planned production capacity of 2.4 million tons.\r\n\r\n\"This Agreement with Keytrade is a major milestone in Brazil Potash's commercial development,\" said Matt Simpson, CEO of Brazil Potash. \"Combined with our existing take-or-pay agreement with Amaggi, we now have the revenue certainty essential for securing project financing and advancing construction.\"\r\n\r\nUnder the deal, Keytrade will purchase 30–37 percent of Brazil Potash’s annual output on a take-or-pay basis. The contract includes a profit-sharing mechanism and allows Brazil Potash to assign future payment rights to financial institutions, supporting project financing.\r\n\r\nAnthony Jezzi, CEO of Keytrade Fertilizantes Brasil, said, “We are thrilled to announce a major contract with Brazil Potash to distribute up to 900,000 tons of potash to the Brazilian industry. This partnership marks a pivotal moment for Keytrade and reinforces our commitment to supporting sustainable agriculture in Brazil.”\r\n\r\nThe offtake obligations will ramp up with production, aligning with Brazil Potash’s construction and financing strategy. Together with ongoing negotiations with additional partners, the company expects to secure commitments for up to 91 percent of its planned production, while reserving a portion for spot sales and flexibility.\r\n",
      "country": "Brazil ",
      "created_at": "2025-08-25 07:53:08",
      "created_by": "Admin",
      "id": "68ac1664aee2dfa06d5547a1",
      "image_caption": "Source: Brazil Potash",
      "mob_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Brazil_Potash_Secures_900,000-Ton_Fertilizer_Offtake_Deal_with_Keytrade_20250825075307/Source:_Brazil_Potash.webp",
      "news_type": "Posts",
      "published_by": "Chemical Today",
      "published_date": "2025-08-25",
      "thumbnail_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Brazil_Potash_Secures_900,000-Ton_Fertilizer_Offtake_Deal_with_Keytrade_20250825075307/Source:_Brazil_Potash.webp",
      "title": "Brazil Potash Secures 900,000-Ton Fertilizer Offtake Deal with Keytrade",
      "visibility": true,
      "web_image_url": "https://new-chemical-today.s3.amazonaws.com/News/Brazil_Potash_Secures_900,000-Ton_Fertilizer_Offtake_Deal_with_Keytrade_20250825075307/Source:_Brazil_Potash.webp"
    }
  ],
  "success": true
}